# Taps


# Brewfile generated from nix-darwin homebrew config

# ============================================================
# Brews (alphabetical)
# ============================================================

brew "colima"
brew "defaultbrowser"
brew "djview4"
brew "docker"
brew "eza"
brew "ffmpeg"
brew "go"
brew "lazygit"
brew "mas"
brew "node"
brew "neovim"
brew "ollama"
brew "oven-sh/bun/bun"
brew "r"
brew "starship"
brew "stow"
brew "tmux"
brew "uv"


# ============================================================
# Casks (alphabetical)
# ============================================================

cask "adguard"
cask "anki"
cask "bruno"
cask "baidunetdisk"
cask "calibre"
cask "claude"
cask "claude-code"
cask "datagrip"
cask "emacs-app"
cask "doubao"
cask "feishu"
cask "font-maple-mono"
cask "font-maple-mono-nf"
cask "font-maple-mono-nf-cn"
cask "font-noto-sans"
cask "font-noto-serif"
cask "google-chrome"
cask "google-drive"
cask "hyperconnect"
cask "iina"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "keyclu"
cask "launchbar"
cask "localsend"
cask "mac-mouse-fix"
cask "mactex-no-gui"
cask "markedit"
cask "neteasemusic"
cask "nutstore"
cask "obsidian"
#cask "orbstack"
cask "pearcleaner"
cask "permute"
cask "poe"
cask "raycast"
cask "rstudio"
cask "shottr"
cask "skim"
cask "taskpaper"
cask "tencent-meeting"
#cask "trae-cn"
#cask "visual-studio-code"
cask "wechat"
cask "wetype"
cask "windows-app"
#cask "windsurf"
cask "wpsoffice-cn"
cask "wezterm"
cask "yuanbao"
cask "zed"

# Commented out casks
# cask "siyuan"
# cask "telegram"

# ============================================================
# Mac App Store (alphabetical)
# ============================================================

mas "Bitwarden", id: 1352778147
mas "Drafts", id: 1435957248
mas "Kindle", id: 302584613
mas "Velja", id: 1607635845
mas "知犀思维导图", id: 1564236678

# Commented out Mac App Store apps
# mas "财新", id: 356023612          # mas 不支持安装 ios/ipad 版
# mas "三联中读-让阅读更高品质", id: 509436231
# mas "微信读书", id: 952059546
